Repository: blynn/gitmagic
Catalog: pl/omegat-tmp/omegat/project_save.tmx
Source language: de_de
Languages: pl

source: bedeutet, ein gelöschter 'Commit' wird nur dann endgültig verloren sein, nachdem 30 Tage vergangen sind und *git gc* ausgeführt wurde.
pl: znaczy, że skasowany 'commit' zostanie nieuchronnie wykasowany dopiero po 30 dniach od wykonania polecenia *git gc*.

source: beginnt einen neuen 'Branch' ``uralt'', welcher den Stand 10 'Commits' zurück vom zweiten Elternteil des ersten Elternteil des 'Commits', dessen Hashwert mit 1b6d beginnt.
pl: rozpoczyna z nowym BRANCH o nazwie '``archaiczny'', ktory posiada stan 10 'commit' spowrotem od drugiego rodzica 'commit', ktorego klucz rozpoczyna sie na 1b6d.

source: bewegt den HEAD Bezeichner drei 'Commits' zurück.
pl: przesunie identyfikator 'HEAD' o 3 'commits' spowrotem.

source: bringt dich wieder in die Gegenwart.
pl: sprowadzi cie znów do teraźniejszości.

source: dann 'Clone' es:
pl: następnie sklonuj go:

source: das jede Zeile in der angegebenen Datei kommentiert um anzuzeigen, wer sie zuletzt geändert hat und wann.
pl: które komentuje każdą linię podanego pliku, by pokazać kto ją ostatnio zmieniał i kiedy.

source: den Zustand der Dateien des anderen Computer auf den übertragen, an dem du gerade arbeitest.
pl: przenosisz stan drugiego komputera na komputer na którym właśnie pracujesz

source: ein um exakt die ausgewählten Änderungen zu 'comitten' (die "inszenierten" Änderungen).
pl: by dokładnie przez ciebie wybrane zmiany 'commit' (zainscenizowane zmiany)

source: gibt einen 'Patch' aus, der zur Diskussion einfach in eine eMail eingefügt werden kann.
pl: produkuje 'patch', który można dołączyć do maila dla dalszej dyskusji.

source: http://de.wikipedia.org/wiki/Harter_Link[Harten Links] ist es zu verdanken, dass ein lokaler Klon weniger Zeit und Speicherplatz benötigt als eine herkömmliche Datensicherung.
pl: Twardym linkom możemy podziękować, że lokalny klon potrzebuje dużo mniej czasu i pamięci niż zwykły backupq

source: http://git.or.cz/[Git] ist eine Art "Schweizer Taschenmesser" für Versionsverwaltung.
pl: http://git.or.cz/[Git] to rodzaj scyzoryka szwajcarskiego dla kontroli wersji.

# int main() { write(1, "Hallo, Welt! ", 14); return 0; } EOT
source: int main() { write(1, "Hallo, Welt!\n", 14); return 0; } EOT
pl: nt main() { write(1, "Hallo, Welt!\n", 14); return 0; } EOT

source: nachdem du das Skript zu deinem `$PATH` hinzugefügt hast.
pl: po uprzednim dodaniu skryptu do `$ PATH`.

source: oder Mercurial:
pl: albo Mercurial:

source: oder von einem der Mirrorserver:
pl: albo z lustrzanego serwera:

source: origin/HEAD origin/master origin/experimentell
pl: origin/HEAD origin/master origin/experimental

source: pick 5c6eb73 Link repo.or.cz hinzugefügt pick a311a64 Analogien in "Arbeite wie du willst" umorganisiert pick 100834f Push-Ziel zum Makefile hinzugefügt
pl: pick 5c6eb73 Link repo.or.cz dodany pick a311a64 zreorganizowano analogie w "Pracuj jak ci sie podoba" pick 100834f dodano cel do Makefile

source: um dein Skript herunterzuladen.
pl: by mogli zładować skrypt.

source: um den 'Patch' anzuwenden.
pl: By zastosować patch.

source: um den Stand eines bestimmten 'Commits' wieder herzustellen und alle nachfolgenden Änderungen für immer zu löschen.
pl: możesz przywrócic stan wybranego commit i wszystkie poźniejsze zmiany bezpowrotnie skasować.

source: um die letzte Beschreibung zu ändern.
pl: by zmienić ostatni opis.

source: um eine zweite Kopie der Dateien und des Git 'Repository' zu erstellen.
pl: by uzyskać drugą kopie danych i utworzyć GIT REPOSITORY.

source: um mehr zu erfahren.
pl: by dowiedzieć się więcej.

source: um zu einem 'Commit' zu springen, dessen Beschreibung so anfängt.
pl: by przenieś się do COMMIT, którego opis właśnie tak sie rozpoczyna,

source: um zur ursprünglichen Arbeit zurückzukehren.
pl: by wrocic do poprzedniego zajęcia

source: und 'commite' bevor du auf den 'Master Branch' zurückschaltest.
pl: i tylko jeszcze 'commit' zanim wrocisz do 'master branch'.

source: und Simsalabim!
pl: i Simsalabim!

source: und das machst du für jede txt-Datei.
pl: i zrób to z każdą następną daną textową.

source: und deine Nutzer können ihr Skript aktualisieren mit:
pl: a twoji uzytkownicy beda mogli zaktualisowac go poprzez:

source: und die letzten zehn 'Commits' erscheinen in deinem bevorzugten $EDITOR. Auszug aus einem Beispiel:
pl: i ostatnie 10 'commits' pojawią się w preferowanym przez ciebie edytorze. Przykładowy wyciąg:

source: und erstelle neue Aktualisierungsbundles mit:
pl: a nowy 'bundle' tworzymy następnie poprzez:

source: und fahre mit deiner ursprünglichen Arbeit fort.
pl: i kontynuujesz przerwane zajęcie

source: und jedermann kann Dein Projekt abrufen mit:
pl: i każdy może teraz sklonować twój projekt przez:

source: und noch viel mehr
pl: i tak dalej.

source: und transportiert das 'Bundle' +einedatei+ irgendwie zum anderen Beteiligten: per eMail, USB-Stick, einen *xxd* Hexdump und einen OCR Scanner, Morsecode über Telefon, Rauchzeichen usw. Der Empfänger holt sich die 'Commits' aus dem 'Bundle' durch Eingabe von:
pl: i transportuje 'bundle' +plik+ do innych zaangażowanych: przez email, stik-usb, *xxd* hexdump i skaner OCR, kod morse przez telefon, znaki dymne itd. Odbiorca wyciąga 'commits' z 'bundle' poprzez podanie:

source: was Dir das Objekt im Klartext anzeigt.
pl: polecenie to pokaże ci zawartość objektu jako tekst.

source: wendet den Urahn des obersten 'Commit' des ``mischmasch'' 'Branch' auf den ``bereinigt'' 'Branch' an.
pl: zmień najwyższy COMMIT z BRANCH miszmasz na oszyszczony BRANCH.

source: wird den 'Commit' mit dem angegebenen Hashwert rückgängig machen.
pl: To polecenie skasuje COMMIT o wybranym hash-u.

source: wodurch 'Commits' nur noch gelöscht werden, wenn Du *git gc* manuell aufrufst.
pl: wtedy 'commits' będą tylko wtedy usuwane, gdy wykonasz ręcznie polecenie *git gc*.

source: zeigt den Namen des aktuellen 'Branch'.
pl: pokaże nazwę aktualnego 'branch'.

source: zeigt dir eine Liste der bisherigen 'Commits' und deren SHA1 Hashwerte:
pl: pokaze ci liste dotychczasowych 'commits' i ich SHA1-hash:

source: Ähnlich kannst du gezielt 'Commits' rückgängig machen.
pl: Podobnie możesze celowo wykasować wybrane COMMITS.

source: Über die Zeit haben sich einige lokale 'Commits' angesammelt und dann synchronisierst du mit einem 'Merge' mit dem offiziellen Zweig.
pl: Z biegiem czasu nagromadziła się wiele 'commits' i wtedy za pomocą 'merge' z oficjalną gałęzią.

source: Übertrage ('push') dein Projekt auf den zentralen Server mit:
pl: Przenieś (PUSH) twój projekt teraz na centralny serwer:

source: Üblicherweise ist deren Verhalten einstellbar.
pl: Zazwyczaj ich zachowanie daje się ustawić.

source: Übrigens, die Dateien in +.git/objects+ sind mit zlib komprimiert, Du solltest sie also nicht direkt anschauen.
pl: Na marginesie, dane w +.git/objects+ są spakowane poprzez zlib, nie powinieneś otwierać ich bezpośrednio.

source: Übung
pl: Cwiczenie
